; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l30_p30_c30_g30_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(crate-content crate29 medicine)
	(crate-content crate30 medicine)
	(at person1 loc25)
	(at person2 loc10)
	(at person3 loc24)
	(at person4 loc5)
	(at person5 loc2)
	(at person6 loc25)
	(at person7 loc13)
	(at person8 loc27)
	(at person9 loc9)
	(at person10 loc18)
	(at person11 loc13)
	(at person12 loc24)
	(at person13 loc12)
	(at person14 loc8)
	(at person15 loc4)
	(at person16 loc20)
	(at person17 loc18)
	(at person18 loc18)
	(at person19 loc1)
	(at person20 loc21)
	(at person21 loc5)
	(at person22 loc6)
	(at person23 loc29)
	(at person24 loc17)
	(at person25 loc20)
	(at person26 loc19)
	(at person27 loc20)
	(at person28 loc21)
	(at person29 loc6)
	(at person30 loc4)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person14 medicine)
	(person-needs person15 food)
	(person-needs person18 food)
	(person-needs person19 food)
	(person-needs person19 medicine)
	(person-needs person20 food)
	(person-needs person21 food)
	(person-needs person21 medicine)
	(person-needs person22 food)
	(person-needs person23 medicine)
	(person-needs person24 food)
	(person-needs person24 medicine)
	(person-needs person25 food)
	(person-needs person25 medicine)
	(person-needs person26 food)
	(person-needs person26 medicine)
	(person-needs person28 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person14 medicine)
	(person-has person15 food)
	(person-has person18 food)
	(person-has person19 food)
	(person-has person19 medicine)
	(person-has person20 food)
	(person-has person21 food)
	(person-has person21 medicine)
	(person-has person22 food)
	(person-has person23 medicine)
	(person-has person24 food)
	(person-has person24 medicine)
	(person-has person25 food)
	(person-has person25 medicine)
	(person-has person26 food)
	(person-has person26 medicine)
	(person-has person28 food)
	))
)

; plan
1. (grab-arm1 drone1 crate30 depot)
   deleted: (arm1-free drone1) (at crate30 depot)
   added: (arm1-load drone1 crate30)
   goals met: 1 of 31
2. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 1 of 31
3. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 0 of 31
4. (move-drone drone1 loc13 loc25)
   deleted: (at drone1 loc13)
   added: (at drone1 loc25)
   goals met: 0 of 31
5. (deliver-arm2 drone1 person6 crate23 medicine loc25)
   deleted: (arm2-load drone1 crate23) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 1 of 31
6. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 2 of 31
7. (grab-arm2 drone1 crate29 depot)
   deleted: (arm2-free drone1) (at crate29 depot)
   added: (arm2-load drone1 crate29)
   goals met: 2 of 31
8. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 1 of 31
9. (move-drone drone1 loc29 loc3)
   deleted: (at drone1 loc29)
   added: (at drone1 loc3)
   goals met: 1 of 31
10. (move-drone drone1 loc3 loc8)
   deleted: (at drone1 loc3)
   added: (at drone1 loc8)
   goals met: 1 of 31
11. (deliver-arm2 drone1 person14 crate29 medicine loc8)
   deleted: (arm2-load drone1 crate29) (person-needs person14 medicine)
   added: (arm2-free drone1) (person-has person14 medicine)
   goals met: 2 of 31
12. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 3 of 31
13. (grab-arm2 drone1 crate28 depot)
   deleted: (arm2-free drone1) (at crate28 depot)
   added: (arm2-load drone1 crate28)
   goals met: 3 of 31
14. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 2 of 31
15. (deliver-arm2 drone1 person19 crate28 medicine loc1)
   deleted: (arm2-load drone1 crate28) (person-needs person19 medicine)
   added: (arm2-free drone1) (person-has person19 medicine)
   goals met: 3 of 31
16. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 4 of 31
17. (grab-arm2 drone1 crate24 depot)
   deleted: (arm2-free drone1) (at crate24 depot)
   added: (arm2-load drone1 crate24)
   goals met: 4 of 31
18. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 3 of 31
19. (deliver-arm2 drone1 person21 crate24 medicine loc5)
   deleted: (arm2-load drone1 crate24) (person-needs person21 medicine)
   added: (arm2-free drone1) (person-has person21 medicine)
   goals met: 4 of 31
20. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 5 of 31
21. (grab-arm2 drone1 crate25 depot)
   deleted: (arm2-free drone1) (at crate25 depot)
   added: (arm2-load drone1 crate25)
   goals met: 5 of 31
22. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 4 of 31
23. (deliver-arm2 drone1 person23 crate25 medicine loc29)
   deleted: (arm2-load drone1 crate25) (person-needs person23 medicine)
   added: (arm2-free drone1) (person-has person23 medicine)
   goals met: 5 of 31
24. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 6 of 31
25. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 6 of 31
26. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 5 of 31
27. (deliver-arm2 drone1 person24 crate22 medicine loc17)
   deleted: (arm2-load drone1 crate22) (person-needs person24 medicine)
   added: (arm2-free drone1) (person-has person24 medicine)
   goals met: 6 of 31
28. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 7 of 31
29. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 7 of 31
30. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 6 of 31
31. (deliver-arm2 drone1 person25 crate26 medicine loc20)
   deleted: (arm2-load drone1 crate26) (person-needs person25 medicine)
   added: (arm2-free drone1) (person-has person25 medicine)
   goals met: 7 of 31
32. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 8 of 31
33. (grab-arm2 drone1 crate27 depot)
   deleted: (arm2-free drone1) (at crate27 depot)
   added: (arm2-load drone1 crate27)
   goals met: 8 of 31
34. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 7 of 31
35. (deliver-arm2 drone1 person26 crate27 medicine loc19)
   deleted: (arm2-load drone1 crate27) (person-needs person26 medicine)
   added: (arm2-free drone1) (person-has person26 medicine)
   goals met: 8 of 31
36. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 9 of 31
37. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 9 of 31
38. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 8 of 31
39. (deliver-arm1 drone1 person5 crate30 medicine loc2)
   deleted: (arm1-load drone1 crate30) (person-needs person5 medicine)
   added: (arm1-free drone1) (person-has person5 medicine)
   goals met: 9 of 31
40. (move-drone drone1 loc2 loc13)
   deleted: (at drone1 loc2)
   added: (at drone1 loc13)
   goals met: 9 of 31
41. (deliver-arm2 drone1 person11 crate13 food loc13)
   deleted: (arm2-load drone1 crate13) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 10 of 31
42. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 11 of 31
43. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 11 of 31
44. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 10 of 31
45. (deliver-arm1 drone1 person12 crate5 food loc24)
   deleted: (arm1-load drone1 crate5) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 11 of 31
46. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 12 of 31
47. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 12 of 31
48. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 12 of 31
49. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 11 of 31
50. (deliver-arm1 drone1 person13 crate4 food loc12)
   deleted: (arm1-load drone1 crate4) (person-needs person13 food)
   added: (arm1-free drone1) (person-has person13 food)
   goals met: 12 of 31
51. (move-drone drone1 loc12 loc8)
   deleted: (at drone1 loc12)
   added: (at drone1 loc8)
   goals met: 12 of 31
52. (deliver-arm2 drone1 person14 crate10 food loc8)
   deleted: (arm2-load drone1 crate10) (person-needs person14 food)
   added: (arm2-free drone1) (person-has person14 food)
   goals met: 13 of 31
53. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 14 of 31
54. (grab-arm2 drone1 crate20 depot)
   deleted: (arm2-free drone1) (at crate20 depot)
   added: (arm2-load drone1 crate20)
   goals met: 14 of 31
55. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 13 of 31
56. (deliver-arm2 drone1 person3 crate20 food loc24)
   deleted: (arm2-load drone1 crate20) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 14 of 31
57. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 15 of 31
58. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 15 of 31
59. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 14 of 31
60. (deliver-arm2 drone1 person15 crate9 food loc4)
   deleted: (arm2-load drone1 crate9) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 15 of 31
61. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 16 of 31
62. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 16 of 31
63. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 16 of 31
64. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 15 of 31
65. (deliver-arm2 drone1 person18 crate21 food loc18)
   deleted: (arm2-load drone1 crate21) (person-needs person18 food)
   added: (arm2-free drone1) (person-has person18 food)
   goals met: 16 of 31
66. (move-drone drone1 loc18 loc1)
   deleted: (at drone1 loc18)
   added: (at drone1 loc1)
   goals met: 16 of 31
67. (deliver-arm1 drone1 person19 crate15 food loc1)
   deleted: (arm1-load drone1 crate15) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 17 of 31
68. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 18 of 31
69. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 18 of 31
70. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 17 of 31
71. (move-drone drone1 loc3 loc10)
   deleted: (at drone1 loc3)
   added: (at drone1 loc10)
   goals met: 17 of 31
72. (deliver-arm2 drone1 person2 crate14 food loc10)
   deleted: (arm2-load drone1 crate14) (person-needs person2 food)
   added: (arm2-free drone1) (person-has person2 food)
   goals met: 18 of 31
73. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 19 of 31
74. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 19 of 31
75. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 19 of 31
76. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 18 of 31
77. (deliver-arm2 drone1 person20 crate7 food loc21)
   deleted: (arm2-load drone1 crate7) (person-needs person20 food)
   added: (arm2-free drone1) (person-has person20 food)
   goals met: 19 of 31
78. (move-drone drone1 loc21 loc5)
   deleted: (at drone1 loc21)
   added: (at drone1 loc5)
   goals met: 19 of 31
79. (deliver-arm1 drone1 person21 crate3 food loc5)
   deleted: (arm1-load drone1 crate3) (person-needs person21 food)
   added: (arm1-free drone1) (person-has person21 food)
   goals met: 20 of 31
80. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 21 of 31
81. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 21 of 31
82. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 20 of 31
83. (deliver-arm1 drone1 person6 crate11 food loc25)
   deleted: (arm1-load drone1 crate11) (person-needs person6 food)
   added: (arm1-free drone1) (person-has person6 food)
   goals met: 21 of 31
84. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 22 of 31
85. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 22 of 31
86. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 21 of 31
87. (deliver-arm1 drone1 person22 crate17 food loc6)
   deleted: (arm1-load drone1 crate17) (person-needs person22 food)
   added: (arm1-free drone1) (person-has person22 food)
   goals met: 22 of 31
88. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 23 of 31
89. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 23 of 31
90. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 22 of 31
91. (deliver-arm1 drone1 person10 crate19 food loc18)
   deleted: (arm1-load drone1 crate19) (person-needs person10 food)
   added: (arm1-free drone1) (person-has person10 food)
   goals met: 23 of 31
92. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 24 of 31
93. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 24 of 31
94. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 24 of 31
95. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 23 of 31
96. (deliver-arm1 drone1 person24 crate6 food loc17)
   deleted: (arm1-load drone1 crate6) (person-needs person24 food)
   added: (arm1-free drone1) (person-has person24 food)
   goals met: 24 of 31
97. (move-drone drone1 loc17 loc13)
   deleted: (at drone1 loc17)
   added: (at drone1 loc13)
   goals met: 24 of 31
98. (deliver-arm2 drone1 person7 crate16 food loc13)
   deleted: (arm2-load drone1 crate16) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 25 of 31
99. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 26 of 31
100. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 26 of 31
101. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 25 of 31
102. (deliver-arm1 drone1 person25 crate18 food loc20)
   deleted: (arm1-load drone1 crate18) (person-needs person25 food)
   added: (arm1-free drone1) (person-has person25 food)
   goals met: 26 of 31
103. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 27 of 31
104. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 27 of 31
105. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 26 of 31
106. (deliver-arm1 drone1 person8 crate8 food loc27)
   deleted: (arm1-load drone1 crate8) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 27 of 31
107. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 28 of 31
108. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 28 of 31
109. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 28 of 31
110. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 27 of 31
111. (deliver-arm1 drone1 person26 crate12 food loc19)
   deleted: (arm1-load drone1 crate12) (person-needs person26 food)
   added: (arm1-free drone1) (person-has person26 food)
   goals met: 28 of 31
112. (move-drone drone1 loc19 loc9)
   deleted: (at drone1 loc19)
   added: (at drone1 loc9)
   goals met: 28 of 31
113. (deliver-arm2 drone1 person9 crate2 food loc9)
   deleted: (arm2-load drone1 crate2) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 29 of 31
114. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 30 of 31
115. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 30 of 31
116. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 29 of 31
117. (deliver-arm2 drone1 person28 crate1 food loc21)
   deleted: (arm2-load drone1 crate1) (person-needs person28 food)
   added: (arm2-free drone1) (person-has person28 food)
   goals met: 30 of 31
118. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 31 of 31
